src/DataProcessors/ВыгрузкаДанныхВФорматеINCAT/ВыгрузкаДанныхВФорматеINCAT.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыгрузкаДанныхВФорматеINCAT</name>
  <comment>//Веденеев 09.01.2018// обработка выгрузки данных в БД MS Access в формате INCAT </comment>
</mdclass:DataProcessor>

src/Catalogs/КаталогПредметовСнабжения/КаталогПредметовСнабжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КаталогПредметовСнабжения</name>
  <attributes>
    <name>НомерОСК</name>
    <comment>Номер в каталоге ОСК</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обозначение</name>
    <comment>№ чертежа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбозначениеТранслитированное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УтвержденноеНаименование</name>
    <comment>Утвержденное наименование на русском</comment>
    <type>
      <types>CatalogRef.УтвержденныеНаименованияПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>СамостоятельнаяПоставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументНаПоставку</name>
    <comment>ТУ, ГОСТ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>CatalogRef.ТипДокументацииДляИзготовленияИПоставкиПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <attributes>
    <name>NSN</name>
    <comment>Номер по системе кодификации НАТО</comment>
    <type>
      <types>String</types>
      <types>CatalogRef.ПредметыСнабженияНАТО</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕКПС</name>
    <type>
      <types>CatalogRef.ЕКПС</types>
    </type>
  </attributes>
  <attributes>
    <name>INCAT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурныйНомерВМФ</name>
    <comment>Номер по базе Юпитер-СТО</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКПД2</name>
    <type>
      <types>CatalogRef.ОКПД2</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>CatalogRef.ТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПрошивки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрошивки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыЗаписейСправочниковИКаталогов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодСнятияСПроизводства</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилаУпаковкиТранспортировкиХранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПоСтруктуре</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шифр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФНН</name>
    <comment>Федеральный номенклатурный номер</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШифрТранслитированный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИзготовителиИПоставщики</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Разработчик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изготовитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокиИзготовления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеПроизводства</name>
      <type>
        <types>CatalogRef.СостоянияПроизводстваПС</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗамены</name>
      <type>
        <types>CatalogRef.ТипыЗаменыПредметаСнабженияАналогом</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Характеристики</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>Основная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтображениеДляЗаказчика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеИзКСУНСИ</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/ВыгрузкаДанныхВФорматеINCAT/Forms/ФормаПроверкиКодов/Module.bsl
&НаСервере
Процедура ВыполнитьГенерациюКодов()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПредметыСнабжения.ПредметСнабжения КАК ПредметСнабжения
	|ПОМЕСТИТЬ втПредметыСнабжения
	|ИЗ
	|	&ПредметыСнабжения КАК ПредметыСнабжения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПредметСнабжения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ПредметСнабжения КАК ПредметСнабжения,
	|	ВложенныйЗапрос.INCAT КАК INCAT
	|ПОМЕСТИТЬ втКоды
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ВложенныйЗапрос.ПредметСнабжения) КАК ПредметСнабжения,
	|		ВЫБОР
	|			КОГДА НЕ ВложенныйЗапрос.NSN = """"
	|				ТОГДА ""NATO-"" + ВложенныйЗапрос.NSN
	|			ИНАЧЕ ВЫБОР
	|					КОГДА НЕ ВложенныйЗапрос.ФНН = """"
	|						ТОГДА ""S"" + &ИдПоставщика + ""-"" + ВложенныйЗапрос.ФНН
	|					ИНАЧЕ ПОДСТРОКА(ВЫБОР
	|								КОГДА ВложенныйЗапрос.INCAT = """"
	|									ТОГДА """"
	|								ИНАЧЕ ""S"" + &ИдПоставщика + ""-"" + ВложенныйЗапрос.INCAT
	|							КОНЕЦ, 1, 32)
	|				КОНЕЦ
	|		КОНЕЦ КАК INCAT
	|	ИЗ
	|		(ВЫБРАТЬ
	|			втПредметыСнабжения.ПредметСнабжения КАК ПредметСнабжения,
	|			ВЫБОР
	|				КОГДА НЕ КаталогПредметовСнабжения.ОбозначениеТранслитированное = """"
	|					ТОГДА КаталогПредметовСнабжения.ОбозначениеТранслитированное
	|				ИНАЧЕ КаталогПредметовСнабжения.Шифр
	|			КОНЕЦ КАК INCAT,
	|			КаталогПредметовСнабжения.ФНН КАК ФНН,
	|			ВЫБОР
	|				КОГДА КаталогПредметовСнабжения.NSN ССЫЛКА Справочник.ПредметыСнабженияНАТО
	|					ТОГДА ВЫРАЗИТЬ(КаталогПредметовСнабжения.NSN.КодNSN КАК СТРОКА(13))
	|				ИНАЧЕ ВЫРАЗИТЬ(КаталогПредметовСнабжения.NSN КАК СТРОКА(13))
	|			КОНЕЦ КАК NSN
	|		ИЗ
	|			втПредметыСнабжения КАК втПредметыСнабжения
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КаталогПредметовСнабжения КАК КаталогПредметовСнабжения
	|				ПО втПредметыСнабжения.ПредметСнабжения = КаталогПредметовСнабжения.Ссылка) КАК ВложенныйЗапрос
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВЫБОР
	|			КОГДА НЕ ВложенныйЗапрос.NSN = """"
	|				ТОГДА ""NATO-"" + ВложенныйЗапрос.NSN
	|			ИНАЧЕ ВЫБОР
	|					КОГДА НЕ ВложенныйЗапрос.ФНН = """"
	|						ТОГДА ""S"" + &ИдПоставщика + ""-"" + ВложенныйЗапрос.ФНН
	|					ИНАЧЕ ПОДСТРОКА(ВЫБОР
	|								КОГДА ВложенныйЗапрос.INCAT = """"
	|									ТОГДА """"
	|								ИНАЧЕ ""S"" + &ИдПоставщика + ""-"" + ВложенныйЗапрос.INCAT
	|							КОНЕЦ, 1, 32)
	|				КОНЕЦ
	|		КОНЕЦ) КАК ВложенныйЗапрос
	|ГДЕ
	|	НЕ ВложенныйЗапрос.INCAT В
	|				(ВЫБРАТЬ
	|					КаталогПредметовСнабжения.INCAT КАК INCAT
	|				ИЗ
	|					Справочник.КаталогПредметовСнабжения КАК КаталогПредметовСнабжения)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПредметСнабжения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПредметыСнабжения.ПредметСнабжения КАК ПредметСнабжения,
	|	КаталогПредметовСнабжения.ОбозначениеТранслитированное КАК Обозначение,
	|	ЕСТЬNULL(втКоды.INCAT, """") КАК INCAT,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(втКоды.INCAT, """") = """"
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Записать,
	|	КаталогПредметовСнабжения.NSN КАК NSN,
	|	КаталогПредметовСнабжения.ФНН КАК ФНН
	|ИЗ
	|	втПредметыСнабжения КАК втПредметыСнабжения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КаталогПредметовСнабжения КАК КаталогПредметовСнабжения
	|		ПО втПредметыСнабжения.ПредметСнабжения = КаталогПредметовСнабжения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКоды КАК втКоды
	|		ПО втПредметыСнабжения.ПредметСнабжения = втКоды.ПредметСнабжения
	|
	|УПОРЯДОЧИТЬ ПО
	|	КаталогПредметовСнабжения.Наименование";
	Запрос.УстановитьПараметр("ПредметыСнабжения", ПредметыСнабжения.Выгрузить());
	Запрос.УстановитьПараметр("ИдПоставщика", Поставщик.КодCAGE);
	
	ПредметыСнабжения.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьКодыINCAT()
	
	МассивСтрок = ПредметыСнабжения.НайтиСтроки(Новый Структура("Записать", Истина));
	
	ДатаНачала = ТекущаяДата();
	Сч = 1;
	ВсегоСтрок = МассивСтрок.Количество();
	
	Для каждого СтрокаПредметСнабжения Из МассивСтрок Цикл
		
		УправлениеИнтерфейсом.ВывестиТекущееСостояние("Запись кодов INCAT...", ДатаНачала, Сч, ВсегоСтрок, , , , БиблиотекаКартинок.ДлительнаяОперация48);
			
		ЗаписатьКодINCAT(СтрокаПредметСнабжения.ПредметСнабжения, СтрокаПредметСнабжения.INCAT);
		
		Сч = Сч + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьКодINCAT(ПредметСнабжения, INCAT)
	
	ПредметСнабженияОбъект = ПредметСнабжения.ПолучитьОбъект();
	ПредметСнабженияОбъект.INCAT = INCAT;
	
	Попытка
		
		ПредметСнабженияОбъект.Записать();
		
	Исключение
		
		Сообщить("Не удалось записать код INCAT предмета снабжения " + Строка(ПредметСнабжения) + Символы.ПС + ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьКодыINCAT(Команда)
	
	Если Не ЗначениеЗаполнено(Поставщик) Тогда
		
		ПоказатьПредупреждение(, "Не указан поставщик!");
		Возврат;
		
	КонецЕсли;
	
	Сообщить("Генерация кодов начата в " + ТекущаяДата());
	Состояние("Генерация кодов INCAT...", , , БиблиотекаКартинок.ДлительнаяОперация48);
	
	ВыполнитьГенерациюКодов();	
	
	Сообщить("Генерация кодов окончена в " + ТекущаяДата());
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ОКПродолжение", ЭтаФорма), "В базу данных будут внесены изменения. Продолжить?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОКПродолжение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		
		ПоказатьПредупреждение(, "Действие отменено!");
		Возврат;
		
	КонецЕсли;
	
	Если ПредметыСнабжения.НайтиСтроки(Новый Структура("INCAT", "")).Количество() > 0 Тогда
		
		ТекстВопроса = "Не все коды INCAT заполнены. Предметы снабжения без кодов INCAT не будут выгружены. Продолжить?";
		ПоказатьВопрос(Новый ОписаниеОповещения("ОКЗавершение", ЭтаФорма), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ЗаписатьКодыINCAT();
		Закрыть(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОКЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ЗаписатьКодыINCAT();
		Закрыть(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Поставщик = Константы.ОсновнаяОрганизация.Получить();
	
	КопироватьДанныеФормы(Параметры.ПредметыСнабжения, ПредметыСнабжения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредметыСнабженияINCATПриИзменении(Элемент)
	
	ТекДанные = Элементы.ПредметыСнабжения.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекДанные.INCAT) Тогда
		
		КоличествоВТаблице = ПредметыСнабжения.НайтиСтроки(Новый Структура("INCAT", ТекДанные.INCAT)).Количество();
		
		Если КоличествоВТаблице > 1 Тогда
			
			Сообщить("Среди сгенерированных кодов уже есть INCAT " + ТекДанные.INCAT);
			ТекДанные.INCAT = "";
			
		Иначе
			
			РезультатПроверки = ПроверитьУникальностьКодаINCAT(ТекДанные.INCAT);
			
			Если Не РезультатПроверки Тогда
				
				Сообщить("Вы базе данных уже есть предмет снабжения с INCAT " + ТекДанные.INCAT);
				ТекДанные.INCAT = "";
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьУникальностьКодаINCAT(INCAT)
	
	Возврат Справочники.КаталогПредметовСнабжения.НайтиПоРеквизиту("INCAT", INCAT).Пустая();
	
КонецФункции


&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	 УстановитьЗначениеФлажков(Истина);
	
КонецПроцедуры


&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	 УстановитьЗначениеФлажков(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеФлажков(ЗначениеФлажков)
	
	Для каждого СтрокаПредметСнабжения Из ПредметыСнабжения Цикл
		
		СтрокаПредметСнабжения.Записать = ЗначениеФлажков;
		
	КонецЦикла;
	
КонецПроцедуры
